<div>
    <h2>
        הסיפור
        האישי שלי
    </h2>
    <p>
        אני זוכר את הפעם הראשונה שנתקלתי בעולם התכנות, הייתי
        חייל משוחרר ישבתי בעמדת שמירה בעבודת האבטחה שלי בשעת לילה מאוחרת עם עוד חבר שברקע ראה סרטון מאתר קורסים מפורסם.
    </p>
    <p >
        שאלתי אותו מה זה כל האותיות והסימנים המוזרים האלה שמופיעים במסך ? איך
        הוא יודע מה לרשום בכל פעם ? חשבתי שהוא צוחק עליי. בחיי.
    </p>
    <p ></p>
    <p >
        אל תוך הלילה אני זוכר איך הוא הסביר לי באופן ממש כללי איך עובד
        האינטרנט ומה זה HTML. ביחד איתו כתבתי את התגיות הראשונות שלי והופיעו לי אלמנטים במסך, אני זוכר איך התרגשתי כמו ילד
        והרגשתי כאילו פרצתי לבית הלבן עם יכולות התכנות החדשות שלי באותו הרגע.
    </p>
    <p></p>
    <p >
        אחרי יומיים
        נרשמתי ללימודי Full stack development במכללה שאת שמה לא אזכיר. הלימודים לקחו שנה ו-4 חודשים ופשוט ירו עלינו חומר בלי
        הפסקה כדי להספיק את הלו"ז של הקורס.
    </p>
    <p>
        לאט לאט תוך כדי הקורס נחשפתי
        לתכנים נוספים באינטרנט ושם התחילו השאלות - האם מה שמלמדים אותי בקורס אלו הטכנולוגיות הכי חמות בשוק העבודה כיום ? האם
        מחסירים ממני מידע רק כדי להספיק את הלו"ז של הקורס ? ועוד שאלות בלי סוף...
    </p>
    <p></p>
    <p>
        במבט לאחור הקורס
        תרם לי לא מעט והכניס אותי לעולם התוכנה, הקורס לימד אותי לכתוב את התגיות וההתניות הראשונות שלי (שעליהן עוד נלמד
        בהמשך), הכרתי מושגים שכנראה היה קשה לי ללמוד אותם לבד אבל שאר הדברים שקיבלתי בקורס היו לגמרי ניתנים להשגה לבד בבית !
        מעבר לכך, עד היום אף מקום עבודה שעבדתי בו או התראיינתי בו לא ביקש ממני את התעודה של הקורס.
    </p>
    <p></p>
    <p >
        האינטרנט מלא
        בקורסים מלאים של שעות על גבי שעות באיכות מצוינת בחינם או במחירים מצחיקים, כך שאם אתם בעלי יכולות למידה עצמית טובות
        תחסכו מעצמכם ותלמדו לבד בבית לפחות את הבסיס. (רק המלצה).
    </p>
    <p></p>
    <p >
        בסדרת המאמרים שתופיע באתר הזה אני הולך ללמד אתכם את יסודות הפיתוח
        ב-WEB, אותן לקח לי לא מעט זמן לכבוש וללמוד ברמה גבוהה. הסיבה המרכזית לכך שלקח לי המון זמן היא חוסר במיקוד. קפצתי
        משפה לשפה וממדריך למדריך ובמקביל ראיתי איך אנשים הופכים למפתחים טובים ומתקבלים לעבודות הראשונות שלהם דיי
        בקלות.
    </p>
    <p></p>
    <h2>
        מגניב, אבל מה איתנו? איך אנחנו נלמד את מה שלמדת?</h2>
    <p>
        לפני הכל חשוב לי לעשות קצת סדר בכל מה שקשור לתכנים כאן באתר.</p>
    <p>
        עולם פיתוח ה-WEB מתחלק ל-2 התמחויות מרכזיות -</p>
    <p>
        הראשונה היא עולם ה-Front-End (יש כאלה שקוראים לזה גם Client side), שזה
        בעצם החלק הוויזואלי של אותו אתר אינטרנט. אם אתם נכנסים לאתר אינטרנט כלשהו ורואים בו אלמנטים זרוקים על המסך (תפריטים,
        כפתורים, לינקים, תמונות ועוד) תדעו שמי שדאג לכך הוא מפתח Front-End. בנוסף להכנסת האלמנטים לתוך דפי האינטרנט מפתחי
        ה-Front-End אחראים גם על העיצוב של אותם אלמנטים, שליפת נתונים ושליחת נתונים אל שרתים (שעל הנושא הזה נלמד בהמשך עוד
        רבות).
    </p>
    <p ></p>
    <p>
        מנגד, העולם השני הוא עולם ה-Back-End (יש כאלה שקוראים לזה גם Server
        side), שזה בעצם "המנוע" האחורי של כל אתר אינטרנט, שם דואגים בעצם לקבלה ושליחת נתונים מהשרת ובחזרה אל הגולש.
    </p>
    <p>
        הדוגמא הטובה ביותר לכך היא טופס צור קשר שיש לנו בהרבה אתרים, בעצם הגולש
        ממלא את הפרטים האישיים שלו ולוחץ "שלח" באותו רגע נשלחת בקשה לשרת והמידע נכנס לתוך בסיס נתונים כלשהו.
    </p>
    <p></p>
    <p ><strong>
        בסדרת
        המאמרים שאכתוב באתר הזה אנחנו לא נתמקד ב-Back-End מהסיבה הפשוטה שבחרתי להתמקד בתחום שאני יותר מבין בו ולמקד אתכם
        הגולשים.</strong>
    </p>
    <p ></p>
    <p><em>
        ** (מעבר ל-Back-End ול-Front-End נולד בשנים האחרונות שילוב שנקרא
        Full Stack שאלו מתכנתים שיודעים להתעסק בכל הצדדים של האתר, גם בחלק הוויזואלי וגם בשרת).</em>
    </p>
    <p></p>
    <p >
        אז איך תדעו שמה
        שאלמד אתכם כאן רלוונטי? את זה לא אני קובע. את סדר המאמרים שלי אני לוקח מהאתר <a href="https://roadmap.sh/frontend"
                                                                                        rel="noopener noreferrer"
                                                                                        target="_blank">הבא</a> שהוא מאוד
        פופולרי והוא מתווה דרך להרבה מפתחי Front-End בתחילת דרכם.
    </p>
    <p ><strong>(אנחנו
        נעבור על הדברים המרכזיים בכל נושא במפה שנמצאת בתוך הלינק).</strong>
    </p>
    <p></p>
    <p >
        כמו שאתם רואים
        במפה מופיעים מלא מלא מושגים שבתור התחלה היו נראים לי ממש מפחידים וכשניגשתי אליהם בהתחלה לא פעם ולא פעמיים זה היה לי
        מאוד מסובך מהסיבה הפשוטה שניגשתי לחלק מהדברים לא לפי הסדר. לדוגמא: ניגשתי ללמוד טכנולוגיה בשם React לפני שלמדתי בכלל
        את שפת Javascript שכל מי שנמצא בתחום יצדיק אותי ויגיד לכם שזה משהו שלא אפשרי כי לפעמים טכנולוגיות מסוימות מבוססות על
        טכנולוגיות אחרות.
    </p>
    <p></p>
    <p>
        הכי גדולה שלי אליכם - תלמדו ממש טוב את טכנולוגיות הבסיס
        : <strong>HTML, CSS, Javascript</strong> ולאחר מכן תקפצו לכל טכנולוגיה סקסית כזאת או אחרת ששמעתם עליה באינטרנט. ברגע
        שתכבשו את הבסיס ותדעו לעבוד איתו טוב יהיה לכם קל עם כל השאר.
    </p>
    <p ></p>
    <p >מקווה שאתם מתרגשים בדיוק כמוני.</p>
    <p>נתראה במאמר הבא. <strong>בהצלחה !</strong></p>
</div>